Revit 2027 API
BuiltInFailures.WallFailures.WallSettingsChanged Property
 Default wall settings will be changed (Base Constraint: [Base Level], Base Offset: [Base Offset], Top Constraint: [Top Level], Top Offset: [Top Offset])
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallSettingsChanged { get; }
Public Shared ReadOnly Property WallSettingsChanged As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallSettingsChanged {
	FailureDefinitionId^ get ();
}
static member WallSettingsChanged : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace